In [1]:
import pandas as pd
emp={'id':[101,102,103,104,105],'Name':['deepak','shyam','arun','manu','jeena'],'age':[25,22,24,20,27],'salary':[25000,30000,150000,10000,30000]}
df=pd.DataFrame(emp)

In [2]:
df

    id    Name  age  salary
0  101  deepak   25   25000
1  102   shyam   22   30000
2  103    arun   24  150000
3  104    manu   20   10000
4  105   jeena   27   30000

In [3]:
emp_data=[(101,'deepak',25,25000),(102,'shyam',22,30000),(103,'arun',24,150000),(104,'manu',20,10000),(105,'jeena',27,30000)]
df=pd.DataFrame(emp_data,columns=['id','name','age','salary'])

In [4]:
df

    id    name  age  salary
0  101  deepak   25   25000
1  102   shyam   22   30000
2  103    arun   24  150000
3  104    manu   20   10000
4  105   jeena   27   30000

In [7]:
emp_data_list=[{'id':101,'name':'deepak','age':25,'salary':25000},{'id':102,'name':'shyam','age':22,'salary':30000},{'id':103,'name':'arun','age':24,'salary':150000},{'id':104,'name':'manu','age':20,'salary':10000},{'id':105,'name':'jeena','age':27,'salary':30000}]
df=pd.DataFrame(emp_data_list)

In [8]:
df

    id    name  age  salary
0  101  deepak   25   25000
1  102   shyam   22   30000
2  103    arun   24  150000
3  104    manu   20   10000
4  105   jeena   27   30000

In [9]:
df=pd.read_csv(r'C:\Users\user\Downloads\stock_data.csv')

In [10]:
print(df)

            Date   Open   High    Low  Close    Volume  Name
0       1/3/2006  39.69  41.22  38.79  40.91  24232729  AABA
1       1/4/2006  41.22  41.90  40.77  40.97  20553479  AABA
2       1/5/2006  40.93  41.73  40.85  41.53  12829610  AABA
3       1/6/2006  42.88  43.57  42.80  43.21  29422828  AABA
4       1/9/2006  43.10  43.66  42.82  43.42  16268338  AABA
...          ...    ...    ...    ...    ...       ...   ...
3014  12/22/2017  71.42  71.87  71.22  71.58  10979165  AABA
3015  12/26/2017  70.94  71.39  69.63  69.86   8542802  AABA
3016  12/27/2017  69.77  70.49  69.69  70.06   6345124  AABA
3017  12/28/2017  70.12  70.32  69.51  69.82   7556877  AABA
3018  12/29/2017  69.79  70.13  69.43  69.85   6613070  AABA

[3019 rows x 7 columns]

In [11]:
import os

In [12]:
print(os.getcwd())

C:\Users\user\Desktop\ASHISH

In [13]:
df1=pd.read_csv('stock_data.csv')

In [14]:
df1

            Date   Open   High    Low  Close    Volume  Name
0       1/3/2006  39.69  41.22  38.79  40.91  24232729  AABA
1       1/4/2006  41.22  41.90  40.77  40.97  20553479  AABA
2       1/5/2006  40.93  41.73  40.85  41.53  12829610  AABA
3       1/6/2006  42.88  43.57  42.80  43.21  29422828  AABA
4       1/9/2006  43.10  43.66  42.82  43.42  16268338  AABA
...          ...    ...    ...    ...    ...       ...   ...
3014  12/22/2017  71.42  71.87  71.22  71.58  10979165  AABA
3015  12/26/2017  70.94  71.39  69.63  69.86   8542802  AABA
3016  12/27/2017  69.77  70.49  69.69  70.06   6345124  AABA
3017  12/28/2017  70.12  70.32  69.51  69.82   7556877  AABA
3018  12/29/2017  69.79  70.13  69.43  69.85   6613070  AABA

[3019 rows x 7 columns]

In [15]:
a= [1,7,2]
myvar = pd.Series(a)
print(myvar)

0    1
1    7
2    2
dtype: int64

In [18]:
print(myvar[2])

2

In [19]:
myvar = pd.Series(a,index=["x","y","z"])
print(myvar)

x    1
y    7
z    2
dtype: int64

In [20]:
print(myvar["y"])

7

In [21]:
calories = {"day1":420,"day2":380,"day3":390}
myvar = pd.Series(calories)
print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [22]:
calories = {"day1":420,"day2":380,"day3":390}
myvar = pd.Series(calories, index= ['day1','day2'])
print(myvar)

day1    420
day2    380
dtype: int64

In [26]:
data=pd.read_csv('intro.txt',delimiter='/t')

C:\Users\user\AppData\Local\Temp\ipykernel_8800\126012288.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  data=pd.read_csv('intro.txt',delimiter='/t')

In [27]:
data

   my name is ashish,
0   i am 24 year old,
1  business analytic,

In [29]:
df=pd.read_excel(r'C:\Users\user\Downloads\employee.xlsx')

In [30]:
df

  gender        dob  occupation  work_exp    salary  own_house  children
0      M 1989-07-31       nurse       2.2  223700.0       True         1
1    NaN 1992-10-30     dentist       6.7  121100.0       True         1
2      F        NaT  accountant       9.0       NaN      False         2
3      F 1987-09-17    engineer       1.7   79900.0      False         0
4      M 1993-01-24     teacher       3.6   32800.0      False         2
5      F        NaT   developer       1.8       NaN       True         1
6      F 1994-09-26       nurse       5.6  272500.0      False         1
7      M 1991-05-07      lawyer       4.1   41600.0      False         0
8      M 1994-12-04     teacher       3.3  141300.0       True         0
9      M 1987-07-10      police       6.5   68000.0       True         1